// Generated by jextract

package dev.jt.tinywl_clj.gen;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct wlr_xcursor_image {
 *     uint32_t width;
 *     uint32_t height;
 *     uint32_t hotspot_x;
 *     uint32_t hotspot_y;
 *     uint32_t delay;
 *     uint8_t *buffer;
 * }
 * }
 */
public class wlr_xcursor_image {

    wlr_xcursor_image() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        C.C_INT.withName("width"),
        C.C_INT.withName("height"),
        C.C_INT.withName("hotspot_x"),
        C.C_INT.withName("hotspot_y"),
        C.C_INT.withName("delay"),
        MemoryLayout.paddingLayout(4),
        C.C_POINTER.withName("buffer")
    ).withName("wlr_xcursor_image");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt width$LAYOUT = (OfInt)$LAYOUT.select(groupElement("width"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t width
     * }
     */
    public static final OfInt width$layout() {
        return width$LAYOUT;
    }

    private static final long width$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t width
     * }
     */
    public static final long width$offset() {
        return width$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t width
     * }
     */
    public static int width(MemorySegment struct) {
        return struct.get(width$LAYOUT, width$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t width
     * }
     */
    public static void width(MemorySegment struct, int fieldValue) {
        struct.set(width$LAYOUT, width$OFFSET, fieldValue);
    }

    private static final OfInt height$LAYOUT = (OfInt)$LAYOUT.select(groupElement("height"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t height
     * }
     */
    public static final OfInt height$layout() {
        return height$LAYOUT;
    }

    private static final long height$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t height
     * }
     */
    public static final long height$offset() {
        return height$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t height
     * }
     */
    public static int height(MemorySegment struct) {
        return struct.get(height$LAYOUT, height$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t height
     * }
     */
    public static void height(MemorySegment struct, int fieldValue) {
        struct.set(height$LAYOUT, height$OFFSET, fieldValue);
    }

    private static final OfInt hotspot_x$LAYOUT = (OfInt)$LAYOUT.select(groupElement("hotspot_x"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t hotspot_x
     * }
     */
    public static final OfInt hotspot_x$layout() {
        return hotspot_x$LAYOUT;
    }

    private static final long hotspot_x$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t hotspot_x
     * }
     */
    public static final long hotspot_x$offset() {
        return hotspot_x$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t hotspot_x
     * }
     */
    public static int hotspot_x(MemorySegment struct) {
        return struct.get(hotspot_x$LAYOUT, hotspot_x$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t hotspot_x
     * }
     */
    public static void hotspot_x(MemorySegment struct, int fieldValue) {
        struct.set(hotspot_x$LAYOUT, hotspot_x$OFFSET, fieldValue);
    }

    private static final OfInt hotspot_y$LAYOUT = (OfInt)$LAYOUT.select(groupElement("hotspot_y"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t hotspot_y
     * }
     */
    public static final OfInt hotspot_y$layout() {
        return hotspot_y$LAYOUT;
    }

    private static final long hotspot_y$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t hotspot_y
     * }
     */
    public static final long hotspot_y$offset() {
        return hotspot_y$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t hotspot_y
     * }
     */
    public static int hotspot_y(MemorySegment struct) {
        return struct.get(hotspot_y$LAYOUT, hotspot_y$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t hotspot_y
     * }
     */
    public static void hotspot_y(MemorySegment struct, int fieldValue) {
        struct.set(hotspot_y$LAYOUT, hotspot_y$OFFSET, fieldValue);
    }

    private static final OfInt delay$LAYOUT = (OfInt)$LAYOUT.select(groupElement("delay"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t delay
     * }
     */
    public static final OfInt delay$layout() {
        return delay$LAYOUT;
    }

    private static final long delay$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t delay
     * }
     */
    public static final long delay$offset() {
        return delay$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t delay
     * }
     */
    public static int delay(MemorySegment struct) {
        return struct.get(delay$LAYOUT, delay$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t delay
     * }
     */
    public static void delay(MemorySegment struct, int fieldValue) {
        struct.set(delay$LAYOUT, delay$OFFSET, fieldValue);
    }

    private static final AddressLayout buffer$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("buffer"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t *buffer
     * }
     */
    public static final AddressLayout buffer$layout() {
        return buffer$LAYOUT;
    }

    private static final long buffer$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t *buffer
     * }
     */
    public static final long buffer$offset() {
        return buffer$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t *buffer
     * }
     */
    public static MemorySegment buffer(MemorySegment struct) {
        return struct.get(buffer$LAYOUT, buffer$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t *buffer
     * }
     */
    public static void buffer(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(buffer$LAYOUT, buffer$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

