// Generated by jextract

package dev.jt.tinywl_clj.gen;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct wlr_seat_pointer_request_set_cursor_event {
 *     struct wlr_seat_client *seat_client;
 *     struct wlr_surface *surface;
 *     uint32_t serial;
 *     int32_t hotspot_x;
 *     int32_t hotspot_y;
 * }
 * }
 */
public class wlr_seat_pointer_request_set_cursor_event {

    wlr_seat_pointer_request_set_cursor_event() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        C.C_POINTER.withName("seat_client"),
        C.C_POINTER.withName("surface"),
        C.C_INT.withName("serial"),
        C.C_INT.withName("hotspot_x"),
        C.C_INT.withName("hotspot_y"),
        MemoryLayout.paddingLayout(4)
    ).withName("wlr_seat_pointer_request_set_cursor_event");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final AddressLayout seat_client$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("seat_client"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct wlr_seat_client *seat_client
     * }
     */
    public static final AddressLayout seat_client$layout() {
        return seat_client$LAYOUT;
    }

    private static final long seat_client$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct wlr_seat_client *seat_client
     * }
     */
    public static final long seat_client$offset() {
        return seat_client$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct wlr_seat_client *seat_client
     * }
     */
    public static MemorySegment seat_client(MemorySegment struct) {
        return struct.get(seat_client$LAYOUT, seat_client$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct wlr_seat_client *seat_client
     * }
     */
    public static void seat_client(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(seat_client$LAYOUT, seat_client$OFFSET, fieldValue);
    }

    private static final AddressLayout surface$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("surface"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct wlr_surface *surface
     * }
     */
    public static final AddressLayout surface$layout() {
        return surface$LAYOUT;
    }

    private static final long surface$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct wlr_surface *surface
     * }
     */
    public static final long surface$offset() {
        return surface$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct wlr_surface *surface
     * }
     */
    public static MemorySegment surface(MemorySegment struct) {
        return struct.get(surface$LAYOUT, surface$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct wlr_surface *surface
     * }
     */
    public static void surface(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(surface$LAYOUT, surface$OFFSET, fieldValue);
    }

    private static final OfInt serial$LAYOUT = (OfInt)$LAYOUT.select(groupElement("serial"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t serial
     * }
     */
    public static final OfInt serial$layout() {
        return serial$LAYOUT;
    }

    private static final long serial$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t serial
     * }
     */
    public static final long serial$offset() {
        return serial$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t serial
     * }
     */
    public static int serial(MemorySegment struct) {
        return struct.get(serial$LAYOUT, serial$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t serial
     * }
     */
    public static void serial(MemorySegment struct, int fieldValue) {
        struct.set(serial$LAYOUT, serial$OFFSET, fieldValue);
    }

    private static final OfInt hotspot_x$LAYOUT = (OfInt)$LAYOUT.select(groupElement("hotspot_x"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int32_t hotspot_x
     * }
     */
    public static final OfInt hotspot_x$layout() {
        return hotspot_x$LAYOUT;
    }

    private static final long hotspot_x$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int32_t hotspot_x
     * }
     */
    public static final long hotspot_x$offset() {
        return hotspot_x$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int32_t hotspot_x
     * }
     */
    public static int hotspot_x(MemorySegment struct) {
        return struct.get(hotspot_x$LAYOUT, hotspot_x$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int32_t hotspot_x
     * }
     */
    public static void hotspot_x(MemorySegment struct, int fieldValue) {
        struct.set(hotspot_x$LAYOUT, hotspot_x$OFFSET, fieldValue);
    }

    private static final OfInt hotspot_y$LAYOUT = (OfInt)$LAYOUT.select(groupElement("hotspot_y"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int32_t hotspot_y
     * }
     */
    public static final OfInt hotspot_y$layout() {
        return hotspot_y$LAYOUT;
    }

    private static final long hotspot_y$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int32_t hotspot_y
     * }
     */
    public static final long hotspot_y$offset() {
        return hotspot_y$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int32_t hotspot_y
     * }
     */
    public static int hotspot_y(MemorySegment struct) {
        return struct.get(hotspot_y$LAYOUT, hotspot_y$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int32_t hotspot_y
     * }
     */
    public static void hotspot_y(MemorySegment struct, int fieldValue) {
        struct.set(hotspot_y$LAYOUT, hotspot_y$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

