// Generated by jextract

package dev.jt.tinywl_clj.gen;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct wlr_render_rect_options {
 *     struct wlr_box box;
 *     struct wlr_render_color color;
 *     const pixman_region32_t *clip;
 *     enum wlr_render_blend_mode blend_mode;
 * }
 * }
 */
public class wlr_render_rect_options {

    wlr_render_rect_options() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        wlr_box.layout().withName("box"),
        wlr_render_color.layout().withName("color"),
        C.C_POINTER.withName("clip"),
        C.C_INT.withName("blend_mode"),
        MemoryLayout.paddingLayout(4)
    ).withName("wlr_render_rect_options");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final GroupLayout box$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("box"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct wlr_box box
     * }
     */
    public static final GroupLayout box$layout() {
        return box$LAYOUT;
    }

    private static final long box$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct wlr_box box
     * }
     */
    public static final long box$offset() {
        return box$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct wlr_box box
     * }
     */
    public static MemorySegment box(MemorySegment struct) {
        return struct.asSlice(box$OFFSET, box$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct wlr_box box
     * }
     */
    public static void box(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, box$OFFSET, box$LAYOUT.byteSize());
    }

    private static final GroupLayout color$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("color"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct wlr_render_color color
     * }
     */
    public static final GroupLayout color$layout() {
        return color$LAYOUT;
    }

    private static final long color$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct wlr_render_color color
     * }
     */
    public static final long color$offset() {
        return color$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct wlr_render_color color
     * }
     */
    public static MemorySegment color(MemorySegment struct) {
        return struct.asSlice(color$OFFSET, color$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct wlr_render_color color
     * }
     */
    public static void color(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, color$OFFSET, color$LAYOUT.byteSize());
    }

    private static final AddressLayout clip$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("clip"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const pixman_region32_t *clip
     * }
     */
    public static final AddressLayout clip$layout() {
        return clip$LAYOUT;
    }

    private static final long clip$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const pixman_region32_t *clip
     * }
     */
    public static final long clip$offset() {
        return clip$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const pixman_region32_t *clip
     * }
     */
    public static MemorySegment clip(MemorySegment struct) {
        return struct.get(clip$LAYOUT, clip$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const pixman_region32_t *clip
     * }
     */
    public static void clip(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(clip$LAYOUT, clip$OFFSET, fieldValue);
    }

    private static final OfInt blend_mode$LAYOUT = (OfInt)$LAYOUT.select(groupElement("blend_mode"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * enum wlr_render_blend_mode blend_mode
     * }
     */
    public static final OfInt blend_mode$layout() {
        return blend_mode$LAYOUT;
    }

    private static final long blend_mode$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * enum wlr_render_blend_mode blend_mode
     * }
     */
    public static final long blend_mode$offset() {
        return blend_mode$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * enum wlr_render_blend_mode blend_mode
     * }
     */
    public static int blend_mode(MemorySegment struct) {
        return struct.get(blend_mode$LAYOUT, blend_mode$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * enum wlr_render_blend_mode blend_mode
     * }
     */
    public static void blend_mode(MemorySegment struct, int fieldValue) {
        struct.set(blend_mode$LAYOUT, blend_mode$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

