// Generated by jextract

package dev.jt.tinywl_clj.gen;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct wlr_pointer_axis_event {
 *     struct wlr_pointer *pointer;
 *     uint32_t time_msec;
 *     enum wlr_axis_source source;
 *     enum wlr_axis_orientation orientation;
 *     double delta;
 *     int32_t delta_discrete;
 * }
 * }
 */
public class wlr_pointer_axis_event {

    wlr_pointer_axis_event() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        C.C_POINTER.withName("pointer"),
        C.C_INT.withName("time_msec"),
        C.C_INT.withName("source"),
        C.C_INT.withName("orientation"),
        MemoryLayout.paddingLayout(4),
        C.C_DOUBLE.withName("delta"),
        C.C_INT.withName("delta_discrete"),
        MemoryLayout.paddingLayout(4)
    ).withName("wlr_pointer_axis_event");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final AddressLayout pointer$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pointer"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct wlr_pointer *pointer
     * }
     */
    public static final AddressLayout pointer$layout() {
        return pointer$LAYOUT;
    }

    private static final long pointer$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct wlr_pointer *pointer
     * }
     */
    public static final long pointer$offset() {
        return pointer$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct wlr_pointer *pointer
     * }
     */
    public static MemorySegment pointer(MemorySegment struct) {
        return struct.get(pointer$LAYOUT, pointer$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct wlr_pointer *pointer
     * }
     */
    public static void pointer(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pointer$LAYOUT, pointer$OFFSET, fieldValue);
    }

    private static final OfInt time_msec$LAYOUT = (OfInt)$LAYOUT.select(groupElement("time_msec"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t time_msec
     * }
     */
    public static final OfInt time_msec$layout() {
        return time_msec$LAYOUT;
    }

    private static final long time_msec$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t time_msec
     * }
     */
    public static final long time_msec$offset() {
        return time_msec$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t time_msec
     * }
     */
    public static int time_msec(MemorySegment struct) {
        return struct.get(time_msec$LAYOUT, time_msec$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t time_msec
     * }
     */
    public static void time_msec(MemorySegment struct, int fieldValue) {
        struct.set(time_msec$LAYOUT, time_msec$OFFSET, fieldValue);
    }

    private static final OfInt source$LAYOUT = (OfInt)$LAYOUT.select(groupElement("source"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * enum wlr_axis_source source
     * }
     */
    public static final OfInt source$layout() {
        return source$LAYOUT;
    }

    private static final long source$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * enum wlr_axis_source source
     * }
     */
    public static final long source$offset() {
        return source$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * enum wlr_axis_source source
     * }
     */
    public static int source(MemorySegment struct) {
        return struct.get(source$LAYOUT, source$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * enum wlr_axis_source source
     * }
     */
    public static void source(MemorySegment struct, int fieldValue) {
        struct.set(source$LAYOUT, source$OFFSET, fieldValue);
    }

    private static final OfInt orientation$LAYOUT = (OfInt)$LAYOUT.select(groupElement("orientation"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * enum wlr_axis_orientation orientation
     * }
     */
    public static final OfInt orientation$layout() {
        return orientation$LAYOUT;
    }

    private static final long orientation$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * enum wlr_axis_orientation orientation
     * }
     */
    public static final long orientation$offset() {
        return orientation$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * enum wlr_axis_orientation orientation
     * }
     */
    public static int orientation(MemorySegment struct) {
        return struct.get(orientation$LAYOUT, orientation$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * enum wlr_axis_orientation orientation
     * }
     */
    public static void orientation(MemorySegment struct, int fieldValue) {
        struct.set(orientation$LAYOUT, orientation$OFFSET, fieldValue);
    }

    private static final OfDouble delta$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("delta"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double delta
     * }
     */
    public static final OfDouble delta$layout() {
        return delta$LAYOUT;
    }

    private static final long delta$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double delta
     * }
     */
    public static final long delta$offset() {
        return delta$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double delta
     * }
     */
    public static double delta(MemorySegment struct) {
        return struct.get(delta$LAYOUT, delta$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double delta
     * }
     */
    public static void delta(MemorySegment struct, double fieldValue) {
        struct.set(delta$LAYOUT, delta$OFFSET, fieldValue);
    }

    private static final OfInt delta_discrete$LAYOUT = (OfInt)$LAYOUT.select(groupElement("delta_discrete"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int32_t delta_discrete
     * }
     */
    public static final OfInt delta_discrete$layout() {
        return delta_discrete$LAYOUT;
    }

    private static final long delta_discrete$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int32_t delta_discrete
     * }
     */
    public static final long delta_discrete$offset() {
        return delta_discrete$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int32_t delta_discrete
     * }
     */
    public static int delta_discrete(MemorySegment struct) {
        return struct.get(delta_discrete$LAYOUT, delta_discrete$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int32_t delta_discrete
     * }
     */
    public static void delta_discrete(MemorySegment struct, int fieldValue) {
        struct.set(delta_discrete$LAYOUT, delta_discrete$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

