// Generated by jextract

package dev.jt.tinywl_clj.gen;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct wlr_xcursor_theme {
 *     unsigned int cursor_count;
 *     struct wlr_xcursor **cursors;
 *     char *name;
 *     int size;
 * }
 * }
 */
public class wlr_xcursor_theme {

    wlr_xcursor_theme() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        C.C_INT.withName("cursor_count"),
        MemoryLayout.paddingLayout(4),
        C.C_POINTER.withName("cursors"),
        C.C_POINTER.withName("name"),
        C.C_INT.withName("size"),
        MemoryLayout.paddingLayout(4)
    ).withName("wlr_xcursor_theme");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt cursor_count$LAYOUT = (OfInt)$LAYOUT.select(groupElement("cursor_count"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * unsigned int cursor_count
     * }
     */
    public static final OfInt cursor_count$layout() {
        return cursor_count$LAYOUT;
    }

    private static final long cursor_count$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * unsigned int cursor_count
     * }
     */
    public static final long cursor_count$offset() {
        return cursor_count$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * unsigned int cursor_count
     * }
     */
    public static int cursor_count(MemorySegment struct) {
        return struct.get(cursor_count$LAYOUT, cursor_count$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * unsigned int cursor_count
     * }
     */
    public static void cursor_count(MemorySegment struct, int fieldValue) {
        struct.set(cursor_count$LAYOUT, cursor_count$OFFSET, fieldValue);
    }

    private static final AddressLayout cursors$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("cursors"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct wlr_xcursor **cursors
     * }
     */
    public static final AddressLayout cursors$layout() {
        return cursors$LAYOUT;
    }

    private static final long cursors$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct wlr_xcursor **cursors
     * }
     */
    public static final long cursors$offset() {
        return cursors$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct wlr_xcursor **cursors
     * }
     */
    public static MemorySegment cursors(MemorySegment struct) {
        return struct.get(cursors$LAYOUT, cursors$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct wlr_xcursor **cursors
     * }
     */
    public static void cursors(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(cursors$LAYOUT, cursors$OFFSET, fieldValue);
    }

    private static final AddressLayout name$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("name"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * char *name
     * }
     */
    public static final AddressLayout name$layout() {
        return name$LAYOUT;
    }

    private static final long name$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * char *name
     * }
     */
    public static final long name$offset() {
        return name$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * char *name
     * }
     */
    public static MemorySegment name(MemorySegment struct) {
        return struct.get(name$LAYOUT, name$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * char *name
     * }
     */
    public static void name(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(name$LAYOUT, name$OFFSET, fieldValue);
    }

    private static final OfInt size$LAYOUT = (OfInt)$LAYOUT.select(groupElement("size"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int size
     * }
     */
    public static final OfInt size$layout() {
        return size$LAYOUT;
    }

    private static final long size$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int size
     * }
     */
    public static final long size$offset() {
        return size$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int size
     * }
     */
    public static int size(MemorySegment struct) {
        return struct.get(size$LAYOUT, size$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int size
     * }
     */
    public static void size(MemorySegment struct, int fieldValue) {
        struct.set(size$LAYOUT, size$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

